SushiBits/platform-stm32f4/include/stm32f410rx_handler.h
/* This file is auto-generated using the IRQN tool. Do not modify. */

#ifndef IRQN_HANDLER

#include <stm32f4xx_it.h>

#else

IRQN_HANDLER(-14, NonMaskableInt_IRQn)
SKIP_HANLDER(-13)
IRQN_HANDLER(-12, MemoryManagement_IRQn)
IRQN_HANDLER(-11, BusFault_IRQn)
IRQN_HANDLER(-10, UsageFault_IRQn)
SKIP_HANLDER(-9)
SKIP_HANLDER(-8)
SKIP_HANLDER(-7)
SKIP_HANLDER(-6)
IRQN_HANDLER(-5, SVCall_IRQn)
IRQN_HANDLER(-4, DebugMonitor_IRQn)
SKIP_HANLDER(-3)
IRQN_HANDLER(-2, PendSV_IRQn)
IRQN_HANDLER(-1, SysTick_IRQn)
IRQN_HANDLER(0, WWDG_IRQn)
IRQN_HANDLER(1, PVD_IRQn)
IRQN_HANDLER(2, TAMP_STAMP_IRQn)
IRQN_HANDLER(3, RTC_WKUP_IRQn)
IRQN_HANDLER(4, FLASH_IRQn)
IRQN_HANDLER(5, RCC_IRQn)
IRQN_HANDLER(6, EXTI0_IRQn)
IRQN_HANDLER(7, EXTI1_IRQn)
IRQN_HANDLER(8, EXTI2_IRQn)
IRQN_HANDLER(9, EXTI3_IRQn)
IRQN_HANDLER(10, EXTI4_IRQn)
IRQN_HANDLER(11, DMA1_Stream0_IRQn)
IRQN_HANDLER(12, DMA1_Stream1_IRQn)
IRQN_HANDLER(13, DMA1_Stream2_IRQn)
IRQN_HANDLER(14, DMA1_Stream3_IRQn)
IRQN_HANDLER(15, DMA1_Stream4_IRQn)
IRQN_HANDLER(16, DMA1_Stream5_IRQn)
IRQN_HANDLER(17, DMA1_Stream6_IRQn)
IRQN_HANDLER(18, ADC_IRQn)
SKIP_HANLDER(19)
SKIP_HANLDER(20)
SKIP_HANLDER(21)
SKIP_HANLDER(22)
IRQN_HANDLER(23, EXTI9_5_IRQn)
IRQN_HANDLER(24, TIM1_BRK_TIM9_IRQn)
SKIP_HANLDER(25)
IRQN_HANDLER(26, TIM1_TRG_COM_TIM11_IRQn)
IRQN_HANDLER(27, TIM1_CC_IRQn)
SKIP_HANLDER(28)
SKIP_HANLDER(29)
SKIP_HANLDER(30)
IRQN_HANDLER(31, I2C1_EV_IRQn)
IRQN_HANDLER(32, I2C1_ER_IRQn)
IRQN_HANDLER(33, I2C2_EV_IRQn)
IRQN_HANDLER(34, I2C2_ER_IRQn)
IRQN_HANDLER(35, SPI1_IRQn)
IRQN_HANDLER(36, SPI2_IRQn)
IRQN_HANDLER(37, USART1_IRQn)
IRQN_HANDLER(38, USART2_IRQn)
SKIP_HANLDER(39)
IRQN_HANDLER(40, EXTI15_10_IRQn)
IRQN_HANDLER(41, RTC_Alarm_IRQn)
SKIP_HANLDER(42)
SKIP_HANLDER(43)
SKIP_HANLDER(44)
SKIP_HANLDER(45)
SKIP_HANLDER(46)
IRQN_HANDLER(47, DMA1_Stream7_IRQn)
SKIP_HANLDER(48)
SKIP_HANLDER(49)
IRQN_HANDLER(50, TIM5_IRQn)
SKIP_HANLDER(51)
SKIP_HANLDER(52)
SKIP_HANLDER(53)
IRQN_HANDLER(54, TIM6_DAC_IRQn)
SKIP_HANLDER(55)
IRQN_HANDLER(56, DMA2_Stream0_IRQn)
IRQN_HANDLER(57, DMA2_Stream1_IRQn)
IRQN_HANDLER(58, DMA2_Stream2_IRQn)
IRQN_HANDLER(59, DMA2_Stream3_IRQn)
IRQN_HANDLER(60, DMA2_Stream4_IRQn)
SKIP_HANLDER(61)
SKIP_HANLDER(62)
SKIP_HANLDER(63)
SKIP_HANLDER(64)
SKIP_HANLDER(65)
SKIP_HANLDER(66)
SKIP_HANLDER(67)
IRQN_HANDLER(68, DMA2_Stream5_IRQn)
IRQN_HANDLER(69, DMA2_Stream6_IRQn)
IRQN_HANDLER(70, DMA2_Stream7_IRQn)
IRQN_HANDLER(71, USART6_IRQn)
SKIP_HANLDER(72)
SKIP_HANLDER(73)
SKIP_HANLDER(74)
SKIP_HANLDER(75)
SKIP_HANLDER(76)
SKIP_HANLDER(77)
SKIP_HANLDER(78)
SKIP_HANLDER(79)
IRQN_HANDLER(80, RNG_IRQn)
IRQN_HANDLER(81, FPU_IRQn)
SKIP_HANLDER(82)
SKIP_HANLDER(83)
SKIP_HANLDER(84)
IRQN_HANDLER(85, SPI5_IRQn)
SKIP_HANLDER(86)
SKIP_HANLDER(87)
SKIP_HANLDER(88)
SKIP_HANLDER(89)
SKIP_HANLDER(90)
SKIP_HANLDER(91)
SKIP_HANLDER(92)
SKIP_HANLDER(93)
SKIP_HANLDER(94)
IRQN_HANDLER(95, FMPI2C1_EV_IRQn)
IRQN_HANDLER(96, FMPI2C1_ER_IRQn)
IRQN_HANDLER(97, LPTIM1_IRQn)

#endif

